

a1 = '''В клинике. Руководитель:
- Вот вам счёт за предстоящее лечение. Деньги вперёд.
Пациент:
- А если лечение не поможет, то деньги назад?
Руководитель:
- Зачем вам тогда будут нужны деньги? '''

a2 = '''У программиста спрашивают:
- Hе помнишь, сколько будет два в четвеpтой?
- (без запинки) Шестнадцать.
- А шестнадцать в четвеpтой?
- (без запинки) Шестьдесят пять тысяч пятьсот тpидцать
шесть.
- Вот голова, ну ты даешь!!! Hу, а тpи в четвеpтой?
- (после паузы) Hе помню точно. Дpобное число получается. '''

a3 = '''Как заработать при помощи Интернета всего в два шага:
1. Отключаем Интернет.
2. Идём работать. '''

a4 = '''Тараканы могут выжить при ядерной войне, а от удара телефоном - не могут.
Это ещё раз доказывает, насколько опасны гаджеты. '''

a5 = '''Программист объясняет сыну решение какой- то задачи:
— Вот, смотри. Пусть у тебя есть 1000 яблок. Нет, для ровного счета - 1024. '''

a6 = '''Почему на айфоне нет вирусов?
Есть, но они платные. '''

a7 = '''Хотите узнать профессию человека? Спросите у него что противоположно единице.
"0" - программист. 
"-1" - инженер.
"-i" - математик.
"отсутствие единицы" - зав. складом. '''

a8 = '''- Говорят, у вас в школе установили самое современное оборудование?
- Да, только есть одна проблема...
- Какая?
- Очень неудобно стирать мел с жидкокристаллических мониторов. '''

a9 = '''Программист у врача:
- Доктор, я болен. Я не могу оторваться от компьютера. По 18 часов в сутки провожу перед монитором!
- Безнадежных случаев не бывает, будем лечить.
- Чем???
- Ясно чем - алкоголем, сигаретами ... '''

a10 = '''Работодатель (Р) и Претендент (П)
Р - В своем резюме вы написали, что знаете следующие языки и технологии программирования: Ваsiс (ТВ, QВ, VВ,VВА, VВ. NЕТ ) С (С аnd С++ fоr Uniх,FrееВSD, QNХ), С++, VС++, С++. NЕТ, С#, в идеале знаете ассемблеры следующих процессоров I-4004 - IР4, Аmigа: (ну и тут список на 2 страницы, мелко и подробно). Ну что же, anekdotov.net, зарплата у нас по договоренности, но гор золота мы вам не сулили. Максимум ,на что вы можете рассчитывать, это 150 тыс Евро.
П -! ?! ?! ?
Р - И только не надо весь рабочий день мечтать о коттедже на Канарах, максимум, что мы можем предложить нашим сотрудникам - это 6-комнатную квартиру в центре Москвы.
П - пытается усидеть на месте, и вести себя пристойно
Р - и не надо думать, что если у шефа красавец Порше, то вы его тоже получите.
Ваш максимум - это ВМW Z8
П - (не выдержав) Врёте!
Р - (Чинно) Ты первый начал. '''

list_data = [a1,a2,a3,a4,a5,a6,a7,a8,a9,a10]